## Usecase of pandas
- Data Cleaning
- Data Analysis
- Data Transformation
- Data Visualization (Basic Level)
- Data Aggregation
- Data Handling
- Data Filtering & Selection
- Time Series analysis

In [2]:
# Series
# A series is a one dimentional labelled array capable of holding any data type. the axis are collectively called the index

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_lst = [10,20,30]
arr = np.array([10,20,30])
dic = {1:10,2:20,3:30}

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(dic)

1    10
2    20
3    30
dtype: int64

In [13]:
pd.Series(my_lst,index=labels)

a    10
b    20
c    30
dtype: int64

# DataFrames
- Creating dataframe
- Selection and indexing of cols 
- Creating new col 
- Removing cols
- selecting rows
- selecting subsets of rows and cols
- conditional selection

In [19]:
data = {
    "Name":['Shivam','Shahi','Rohan','Raghav','Ram'],
    "Age": [20,23,34,56,78],
    "City":["New York","Paris","Berlin","London","India"],
    "Salary":[65000,70000,62000,85000,np.nan]
}

df = pd.DataFrame(data)

In [20]:
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN

In [26]:
df['Age'].astype(float)

0    20.0
1    23.0
2    34.0
3    56.0
4    78.0
Name: Age, dtype: float64

In [27]:
df

     Name  Age      City   Salary
0  Shivam   20  New York  65000.0
1   Shahi   23     Paris  70000.0
2   Rohan   34    Berlin  62000.0
3  Raghav   56    London  85000.0
4     Ram   78     India      NaN